Revit 2024 API
DuctLining Class
 Represents Lining applied to the inside of a given duct, fitting or accessory.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class DuctLining : InsulationLiningBase
Visual Basic
Public Class DuctLining _
	Inherits InsulationLiningBase
Visual C++
public ref class DuctLining : public InsulationLiningBase
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.MEPCurve
 Autodesk.Revit.DB.InsulationLiningBase
 Autodesk.Revit.DB.Mechanical.DuctLining
See Also
DuctLining Members
Autodesk.Revit.DB.Mechanical Namespace